[
  {
    "title": "Applying Prochaska & Di Clemente Model in The Siraat AlIslāmic Psychotherapy Practice model",
    "file": "Applying%20Prochaska%20%26%20Di%20Clemente%20Model%20.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog explores the application of the Prochaska & Di Clemente Stages of Change model within the Siraat Islāmic Psychotherapy Practice, highlighting practical strategies for guiding clients through meaningful behavioral and spiritual transformation."
  },
  {
    "title": "Cherry-Picking and Weak Scholarship in Islāmic Psychology Literature: Are we disseminating fake information?",
    "file": "Cherry-Picking.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog critically examines selective reporting and weak scholarship in Islāmic psychology literature, questioning the reliability of information being disseminated."
  },
  {
    "title": "Faith-Based Solutions for Addiction Prevention in Public Health ",
    "file": "Faith-Based-Solutions%20.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog examines faith-based approaches to addiction prevention, emphasizing how spiritual guidance can complement public health strategies. "
  },
  {
    "title": "Harmony and dissonance: Jungian therapy and Islāmic psychotherapy",
    "file": "Harmony-and-dissonance.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog explores the integration of Jungian therapy with Islāmic psychotherapy, examining points of harmony and areas of conceptual dissonance in practice."
  },
  {
    "title": "IIm al-Nafs (Authentic Islāmic Psychology) Telegram ",
    "file": "IIm-al-Nafs.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog introduces Ilm al-Nafs (Authentic Islāmic Psychology), discussing its principles and how they inform contemporary psychological practice and inviting you to join the Telegram group for further discussion."
  },
  {
    "title": "Ibn Qayyim al-Jawzīyah & Islāmīc Psychology",
    "file": "Ibn-Qayyim.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog explores the contributions of Ibn Qayyim al-Jawzīyah to Islāmic psychology, highlighting his insights on mental well-being and spiritual guidance."
  },
  {
    "title": "LE DÉVELOPPEMENT DE LA SCIENCE DE L’ÂME: MÉDECINS DE LA RENAISSANCE ISLĀMIQUE",
    "file": "LE-DÉVELOPPEMENT.pdf",
    "language": "French",
    "format": "PDF",
    "excerpt": "Ce blog explore le développement de la science de l’âme pendant la Renaissance islamique, en mettant en lumière les contributions des médecins et savants pionniers."
  },
  {
    "title": "Réflexions critiques sur l'état actuel de la recherche en psychologie Islāmique: Défis et solutions",
    "file": "Master.pdf",
    "language": "French",
    "format": "PDF",
    "excerpt": "Ce blog propose des réflexions critiques sur l’état actuel de la recherche en psychologie islamique, en identifiant les principaux défis et en suggérant des solutions."
  },
  {
    "title": "Piracy",
    "file": "Piracy.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog examines the issue of piracy from an ethical and Islamic perspective, discussing its implications for society and public conduct."
  },
  {
    "title": "Post-modern Therapies: Congruence or Dissonance with Islāmic Spirituality",
    "file": "Post-modern-Therapies.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog examines post-modern therapeutic approaches, evaluating their points of congruence and dissonance with Islāmic spirituality."
  },
  {
    "title": "Professional Humility",
    "file": "Professional-Humility.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog examines the concept of professional humility in the context of contemporary Islāmīc psychology."
  },
  {
    "title": "Prohibitions and Regulations Regarding Drugs, Alcohol, and Gambling: An Islāmic Perspective",
    "file": "Prohibitions-and-Regulations%20.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": " This blog outlines Islamic prohibitions and regulations concerning drugs, alcohol, and gambling, highlighting their relevance for ethical guidance and public health."
  },
  {
    "title": "Research Scholarship in Islāmic Psychology",
    "file": "Research-Scholarship.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": " This blog explores the landscape of research scholarship in Islāmic psychology, highlighting key studies, trends, and emerging areas of inquiry. "
  },
  {
    "title": "Spiritual Integration in Islāmic Psychotherapy: Unveiling the Therapist's Soul ",
    "file": "Spiritual-Integration.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog explores the role of spiritual integration in Islāmic psychotherapy, emphasizing the therapist’s inner development and reflective practice. "
      
  },
  {
    "title": "The Rise of Pseudo-Experts in Islāmīc Psychology",
    "file": "The%20rise%20of%20pseudo.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "An analysis of the ethical and scholarly challenges posed by pseudo-experts in contemporary Islāmīc psychology."
  },
  {
    "title": "The Qur’ân and Prophetic Guidance: An Overview in the Context of New Public Health ",
    "file": "the-quran-and-prophetic-guidance.pdf",
    "language": "English",
    "format": "PDF",
    "excerpt": "This blog explores the Qur’ân and Prophetic guidance, highlighting their relevance and application in contemporary public health practice."
  }
]